Repository: tux4kids/tuxmath
Catalog: po/*.po
Languages: gd

source: Congratulations! You win!
gd: Meal do naidheachd! Bhuannaich thu!

source: Round
gd: Cuairt

source: -[Esc] to skip
gd: -[Esc] gus leam a ghearradh

source: Mission One: Careful Cadet
gd: Gnìomh a h-aon: Òglach seòlta

source: I'm so glad you've come!
gd: Tha mi glè thoilichte gun dàinig thu!

source: The penguins need your help! Comets are falling from the sky, and are melting the penguins' igloos. To save their homes, we need you to find the secret code that will zap each comet.
gd: Tha na cinn-fhionn feumaich air cobhair! Tha comaidean a’ tuiteam on adhar agus tha iad a leaghadh taighean-sneachda nan ceann-fionn. Feumaidh tu an còd dìomhair a lorg a loisgeas air na comaidean ach an sàbhail thu na taighean aca.

source: Do your best!
gd: Dèan do dhìcheall!

source: Mission Two: Smart Scout
gd: Gnìomh a dhà: Beachdair tapaidh

source: Great job! Since you saved the penguins' homes, we are promoting you to Scout. Scouts are good for keeping an eye out for trouble...
gd: Sin thu! On a shàbhail thu taighean nan ceann-fionn, bhuannaich thu rang a’ bheachdair. Tha beachdairean math air sùil a chumail amach airson trioblaid...

source: ...like what's happening right now! The TakeAways have come, and they're sending new, trickier comets against the penguins!
gd: ...agus thàinig trioblaid oirnn mar-thà! Thàinig an luchd-ionnsaigh a-rithist agus tha iad a’ cur comaidean cunnartach ùra an comhair nan ceann-fionn!

source: But you can save them!
gd: Ach ’s urrainn dhut an sàbhaladh!

source: Mission Three: Royal Ranger
gd: Gnìomh a trì: Maor loinneil

source: You've done it again! The Penguin Emperor has chosen you to join his team of Rangers that help protect the city. We're sending you there now...
gd: Rinn thu a’ chùis air a-rithist! Thagh impire nan ceann-fionn thu ach an dig thu an sas ann an sgioba nam maor aige a chuidicheas le dìon a’ baile. Bheir sinn a-null thu a-nis...

source: ...oh no! Now the Emperor himself is under attack, from new types of comets: these problems are multiplying! To fight these, you need great skill. We think you can do it. Join the Rangers and help save the city!
gd: ... och ochan ò! Tha an t-impire fhèin fo ionnsaigh a-nis o sheòrsa ùr dhe chomais: tha na trioblaidean ag iomadachadh! Feumaidh tu a bhith glè sheòlta gus sabaid an aghaidh an fheadhainn seo. Saoilidh sinn gu bheil thu comasach. Sàbhail am baile còmhla ris na maoir eile!

source: Mission Four: Imperial Ace
gd: Gnìomh a ceithir: Curaidh cliùiteach

source: You did it! The Emperor wants to thank you in person. We are taking you to his ice palace for a great honor: you will become the Imperial Ace!
gd: Rinn thu a’ chùis air! Bu toigh leis an impire taing a thoirt dhut gu pearsanta. Bheir sinn dhan lùchairt deighe aige thu ach am faigh thu urram mòr: thèid thu ’nad churaidh cliùiteach na h-impireachd!

source: But right in the middle of the ceremony, a new attack from the land of Division starts!
gd: Ach ann an teas-mheadhan na cuirme, thàinig ionnsaigh ùr o thìr an roinnidh oirbh!

source: Now is no time for resting; the city needs your help!
gd: Chan eil ùine agad gus d’ anail a ghabhail; tha am baile feumach air do chuideachadh!

source: Final Mission: Computing Commando
gd: An gnìomh mu dheireadh: Sàr-ghaisgeach an àireamhachaidh

source: Penguin scientists have learned that all these attacks are coming from a secret base, and they need you to go fight the final battle. They also give you this clue: first do multiplication and division, and then do addition and subtraction.
gd: Fhuair eòlasan nan ceann-fionn a-mach gu bheil na h-ionnsaighean uile a’ tighinn o bhunait dhìomhair agus feumaidh tu dol dhan bhlàr deireannach. Mhol iad cuideachd gun dèan thu iomadachadh is roinneadh an toiseach agus cur ris is toirt air falbh an uairsin.

source: I hope that hint helps!
gd: Tha mi ’n dòchas gun cuidich an gliocas sin!

source: This is it! You can stop these attacks forever, Commando!
gd: Seo an cothrom againn! ’S urrainn dhan bhuidheann agad stad a ghur air na h-ionnsaighean seo gu bràth tuilleadh, a’ ghaisgich!

source: Sorry, try again!
gd: Duilich, feuch ris a-rithist!

source: Mission accomplished. The galaxy is safe!
gd: Choilean thu an gnìomh. Tha an cruinne-cè sàbhailte a-nis!

source: TUX, OF MATH COMMAND
gd: TUX, GAISGEACH a’ MHATAMATAIG

source: COPYRIGHT 2001-2011
gd: CÒIR-LETHBHREAC 2001-2011

source: VERSION
gd: TIONNDADH

source: PART OF THE 'TUX4KIDS' PROJECT
gd: ’NA PHÀIRT DHEN PHRÒISEACT “TUX4KIDS”

source: DESIGNED BY
gd: AIR A DHEALBHACHADH LE

source: LEAD PROGRAMMERS
gd: PRÌOMH-PHRÒGRAMAIREAN

source: ADDITIONAL CODE
gd: CÒD A BHARRACHD

source: LEAD ARTISTS
gd: PRÌOMH LUCHD-EALAIN

source: ADDITIONAL ART
gd: OBAIR-EALAIN A BHARRACHD

source: SOUND EFFECTS
gd: ÈIFEACHDAN FUAIME

source: MUSIC
gd: CEÒL

source: PACKAGERS
gd: LUCHD-PACAIDIDH

source: 'TUX' THE PENGUIN CREATED BY
gd: CHAIDH AN CEANN-FIONN “TUX” A CHRUTHACHADH LE

source: TESTERS
gd: LUCHD-DEUCHAINN

source: USER WEBSITE
gd: LÀRACH-LÌN an LUCHD-CLEACHDAIDH

source: TUX4KIDS DEVELOPMENT HOSTED AT ALIOTH:
gd: THA LEASACHADH TUX4KIDS ’GA ÒSTADH AIR ALIOTH:

source: TuxMath is Free Software licensed under the GNU General Public License (GPL). As such, you are specifically granted the rights that are usually denied to users of proprietary software.
gd: ’S e bathar-bog saor a th’ ann an TuxMath fo cheadachas GNU General Public License (GPL). Mar sin, tha na còraichean agad a dh’aona-ghnothaich a thèid a dhiùltadh air daoine a chleachdas bathar-bog fo sheilbh.

source: These rights include the freedom to study, copy, modify, and redistribute the program.
gd: Tha na còraichean seo a’ gabhail a-steach gum faod thu am prògram a sgrùdadh, lethbhreac a dhèanamh dheth, atharrachadh agus a sgaoileadh gu saor.

source: A full copy of the GPL is included with the documentation for this program.
gd: Gheibh thu lethbhreac slàn dhen GPL an cois an docamaididh airson a’ phrògraim seo.

source: For more information about Free Software and the GNU GPL, visit:
gd: Airson barrachd fiosrachaidh mu bhathar-bog saor agus GNU GPL, tadhail air:

source: Hall Of Fame
gd: Clàr nan curaidhean

source: Space Cadet
gd: Òglach fànais

source: Scout
gd: Beachdair

source: Ranger
gd: Maor

source: Ace
gd: Curaidh

source: Commando
gd: Sàr-ghaisgeach

source: Factors
gd: Factaran

source: Fractions
gd: Bloighean

source: You Are In The Hall of Fame!
gd: Bhuannaich thu àite air clàr nan cuiridhean!

source: Enter Your Name:
gd: Cuir d’ ainm a-steach:

source: TuxMath version %s is free and open-source! You can help make it better. Suggestions, artwork, and code are all welcome! Discuss TuxMath at tuxmath-devel@list.sourceforge.net
gd: Tha TuxMath tionndadh %s saor agus open-source! ’S urrainn dhut ar cuideachadh gus piseach a thoirt air. Cuiridh sinn fàilte air molaidhean, obair-ealain agus còd! Deasbair TuxMath air tuxmath-devel@list.sourceforge.net

source: Edit 'options' file in you home directory to create customized game! Press a key or click your mouse to start game. See README.txt for more information.
gd: Deasaidh am faidhle “options” da phasgan-dachaigh agad gus geama gnàthaichte a chruthachadh! Brùth air iuchair no briog leis an luchag agad gus geama a thòiseachadh. Faic README.txt airson barrachd fiosrachaidh.

source: How many kids are playing?
gd: Co mheud clann a tha a’ cluich?

source: (Between 2 and 4 players)
gd: (Eadar 2 is 4 cluicheadairean)

source: The server is already running
gd: Tha am frithealaiche ’ga ruith mar-thà

source: The port is in use by another program on this computer, most likely another Tux Math server
gd: Tha am port ’ga chleachdadh le prògram eile air a’ choimpiutair seo, tha sinn an dùil gur e frithealaiche Tux Math eile a th’ ann

source: Enter Server Name:
gd: Cuir a-steach ainm an fhrithealaiche:

source: (limit 50 characters)
gd: (suas ri 50 caractar)

source: Click or press key to select server lesson file
gd: Briog no brùth air iuchair gus faidhle leasain an fhrithealaiche a thaghadh

source: Server Name: %s Selected Lesson: %s
gd: Ainm an fhrithealaiche: %s An leasan a chaidh a thaghadh: %s

source: Sorry, this version built without network support.
gd: Duilich ach chaidh an tionndadh seo a thogail gun taic dha lìonraidhean.

source: Sorry, this version built without network support.
gd: Duilich ach chaidh an tionndadh seo a thogail gun taic dha lìonraidhean.

source: The server is not running.
gd: Chan eil am frithealaiche a’ ruith.

source: Cannot stop server until current game finishes.
gd: Cha ghabh stad a chur air an fhrithealaiche mus bi an geama làithreach seachad.

source: The server has been stopped.
gd: Chaidh stad a chur air an fhrithealaiche.

source: Sorry, could not connect to server.
gd: Duilich ach cha b’ urrainn dhuinn ceangal ris an fhrithealaiche.

source: Sorry, could not connect to server.
gd: Duilich ach cha b’ urrainn dhuinn ceangal ris an fhrithealaiche.

source: Sorry, game already in progress
gd: Duilich ach tha geama ’ga ruith mar-thà

source: Connection with server was lost
gd: Chaidh an ceangal dhan fhrithealaiche air chall

source: Sorry, this version built without network support
gd: Duilich ach chaidh an tionndadh seo a thogail gun taic dha lìonraidhean.

source: Go!
gd: Siuthad!

source: Then %s
gd: Agus %s ’na dhèidh

source: Who is playing first?
gd: Cò chluicheas an toiseach?

source: Enter your name:
gd: Cuir d’ ainm a-steach:

source: Who is playing next?
gd: Cò chluicheas an uairsin?

source: How many rounds will you play?
gd: Co mheud cuairt?

source: Enter a number
gd: Cuir a-steach àireamh

source: Await player name
gd: A’ fuireach air ainm a’ chluicheadair

source: Work In Progress! This feature is not ready yet Discuss the future of TuxMath at tuxmath-devel@lists.sourceforge.net
gd: Tha sinn ag obair air fhathast! Chan eil am feart seo deiseil fhathast Deasbair air TuxMath air tuxmath-devel@lists.sourceforge.net

source: Number Typing
gd: Sgrìobhadh àireamhan

source: Addition: 1 to 3
gd: Cur ris: 1 gu 3

source: Addition: 0 to 5
gd: Cur ris: 0 gu 5

source: Addition: Sums to 10
gd: Cur ris: Iomlain gu 10

source: Addition: Sums to 15
gd: Cur ris: Iomlain gu 15

source: Addition: Sums to 20
gd: Cur ris: Iomlain gu 20

source: Addition: Two Digit Numbers
gd: Cur ris: Àireamhan le dà fhigear

source: Addition: Missing Numbers
gd: Cur ris: Àireamhan a dhìth

source: Subtraction: 0 to 10
gd: Toirt air falbh: 0 gu 10

source: Subtraction: 0 to 20
gd: Toirt air falbh: 0 gu 20

source: Subtraction: Two Digit Numbers
gd: Toirt air falbh: Àireamhan le dà fhigear

source: Addition and Subtraction Review
gd: Ath-sgrùdadh air cur ris is toirt air falbh

source: Multiplication: 0 to 3
gd: Iomadachadh: 0 gu 3

source: Multiples of 2
gd: Iomadachadh le 2

source: Multiples of 3
gd: Iomadachadh le 3

source: Multiples of 4
gd: Iomadachadh le 4

source: Multiples of 5
gd: Iomadachadh le 5

source: Multiplication: 0 to 5
gd: Iomadachadh: 0 gu 5

source: Multiples of 6
gd: Iomadachadh le 6

source: Multiples of 7
gd: Iomadachadh le 7

source: Multiplication: 0 to 7
gd: Iomadachadh: 0 gu 7

source: Multiples of 8
gd: Iomadachadh le 8

source: Multiples of 9
gd: Iomadachadh le 9

source: Multiples of 10
gd: Iomadachadh le 10

source: Multiplication: 0 to 10
gd: Iomadachadh: 0 gu 10

source: Multiples of 11 and 12
gd: Iomadachadh le 11 agus 12

source: Multiplication: 0 to 12
gd: Iomadachadh: 0 gu 12

source: Multiples of 13, 14, and 15
gd: Iomadachadh le 13, 14 agus 15

source: Multiplication: 0 to 15
gd: Iomadachadh: 0 gu 15

source: Multiplication: Missing Numbers
gd: Iomadachadh: Àireamhan a dhìth

source: Division by 2
gd: Roinneadh le 2

source: Division by 3
gd: Roinneadh le 3

source: Division by 4
gd: Roinneadh le 4

source: Division by 5
gd: Roinneadh le 5

source: Division: 1 to 5
gd: Roinneadh: 1 gu 5

source: Division by 6
gd: Roinneadh le 6

source: Division by 7
gd: Roinneadh le 7

source: Division by 8
gd: Roinneadh le 8

source: Division by 9
gd: Roinneadh le 9

source: Division by 10
gd: Roinneadh le 10

source: Division: 1 to 10
gd: Roinneadh: 1 gu 10

source: Division by 11 and 12
gd: Roinneadh le 11 agus 12

source: Division: 1 to 12
gd: Roinneadh: 1 gu 12

source: Division by 13, 14, and 15
gd: Roinneadh le 13, 14 agus 15

source: Division: 1 to 15
gd: Roinneadh: 1 gu 15

source: Multiplication and Division Review
gd: Ath-sgrùdadh air iomadachadh is roinneadh

source: Typing Negative Numbers
gd: Sgrìobhadh àireamhan àicheil

source: Subtraction: Negative Answers
gd: Toirt air falbh: freagairtean àicheil

source: Adding Negatives to Positives
gd: Cur àireamhan àicheil ri àireamhan dearbha

source: Adding Positives to Negatives
gd: Cur àireamhan dearbha ri àireamhan àicheil

source: Subtracting Negatives From Positives
gd: Toirt air falbh àireamhan àicheil o àireamhan dearbha

source: Subtracting Positives From Negatives
gd: Toirt air falbh àireamhan dearbha o àireamhan àicheil

source: Adding Negatives to Negatives
gd: Cur àireamhan àicheil ri àireamhan àicheil

source: Subtracting Negatives From Negatives
gd: Toirt air falbh àireamhan àicheil o àireamhan àicheil

source: Negative and Positive Numbers Review
gd: Ath-sgrùdadh air àireamhan àicheil is dearbha

source: Multiplication and Division of Negatives
gd: Iomadachadh is roinneadh le àireamhan àicheil

source: Multiplication of Positives and Negatives
gd: Iomadachadh le àireamhan dearbha is àicheil

source: Division of Positives and Negatives
gd: Roinneadh le àireamhan dearbha is àicheil

source: Credits
gd: Urram

source: Elimination
gd: Cur às

source: Factoroids
gd: Factaraidean

source: Help
gd: Cobhair

source: Join Game
gd: Gabh pàirt sa gheama

source: Main Menu
gd: Am prìomh chlàr-taice

source: Math Command Fleet Missions
gd: Gnìomhan cabhlaich nan gaisgeach matamataig

source: Math Command Training Academy
gd: Taigh-oilein nan gaisgeach matamataig

source: More Options
gd: Barrachd roghainnean

source: Network Game
gd: Geama lìonraidh

source: Play Alone
gd: Cluich ’nad aonar

source: Play Arcade Game
gd: Cluich faoin-chleas

source: Play Custom Game
gd: Cluich geama gnàthaichte

source: Play With Friends
gd: Cluich còmhla ri do charaidean

source: Project Info
gd: Fiosrachadh mun phròiseact

source: Quit
gd: Fàg an-seo

source: Run Server
gd: Ruith frithealaiche

source: Score Sweep
gd: Gabhail nan sgòr

source: Stop Server
gd: Cuir stad air an fhrithealaiche

source: Additional options
gd: Barrachd roghainnean

source: Complete missions for the Math Command Fleet
gd: Coilean gnìomhan às leth cabhlach nan gaisgeach matamataig

source: Customize the game you play
gd: Gnàthaich an geama a chluicheas tu

source: Earn Gold Stars as you build your math skills with each mission
gd: Buannaich rionnagan òir fhad ’s a chuireas tu ris na sgilean matamataig agad le gach gnìomha

source: Easier
gd: Nas fhasa

source: Easiest
gd: As fhasa

source: Easy
gd: Furasta

source: Exit to your desktop
gd: Fàg dhan deasg agad

source: Factorize numbers with your laser beam!
gd: Dèan factaran dhe dh’àireamhan leis a’ ghath leusair agad!

source: Hard
gd: Doirbh

source: Hardest
gd: As dorra

source: High Scores
gd: Sgòran àrda

source: Join a game on a server running on your network
gd: Gabh pàirt ann an geama air frithealaiche a tha a’ ruith air an lìonra agad

source: Make the Hall of Fame by beating the highest score
gd: Buannaich àite air clàr nan cuiridhean le sgòr àrd

source: Moderate
gd: Meadhanach

source: Play a game with your friends on a local network
gd: Cluich geama le do charaidean air lìonra ionadail

source: Play and learn on your own
gd: Cluich is ionnsaich leat fhèin

source: Players with the lowest scores are eliminated every round
gd: Thèid na cluicheadairean leis an sgòr as ìsle a thoirt air falbh gach cuairt

source: Return to the main menu
gd: Till dhan phrìomh chlàr-taice

source: Run a demo of the game
gd: Ruith demo dhen gheama

source: See how to play the game
gd: Seall mar a chluicheas tu an geama

source: See the credits for the game
gd: Seall urram airson a’ gheama

source: See the project info
gd: Seall fiosrachadh mun phròiseact

source: Start a server for a network game
gd: Tòisich frithealaiche airson geama lìonraidh

source: Stop a server running on your machine
gd: Cuir stad air frithealaiche a tha a’ ruith air an uidheam agad

source: Take turns in a game with your friends on a single computer
gd: Cluich an geama le do charaidean neach mu seach air an aon choimpiutair

source: The person with the highest score wins
gd: Buannaichidh an neach leis an sgòr as àirde
